{
 "0": { "name": "The Spectator", "group": "Traditionalist", "description": "You prefer to observe life from the sidelines. You value privacy and routine but often feel overwhelmed by stress.", "happiness_tip": "Start small. Pick one routine and stick to it." },
 "1": { "name": "The Stoic", "group": "Traditionalist", "description": "Calm, detached, and pragmatic. You are unshakeable in a crisis but can come across as cold.", "happiness_tip": "Practice 'active empathy.' Ask others how they feel." },
 "2": { "name": "The Skeptic", "group": "Traditionalist", "description": "Kind-hearted but anxious. You often worry about what others think and may have trouble asserting yourself.", "happiness_tip": "Learn to say 'No.' Your desire to please leads to burnout." },
 "3": { "name": "The Rock", "group": "Traditionalist", "description": "Easy-going, stable, and friendly. A low-maintenance friend who goes with the flow.", "happiness_tip": "Set a goal. Contentment can lead to stagnation." },
 "4": { "name": "The Loner", "group": "Traditionalist", "description": "Impulsive and reactive. You seek stimulation but often find yourself in conflicts.", "happiness_tip": "Pause before reacting. Count to ten when angry." },
 "5": { "name": "The Maverick", "group": "Traditionalist", "description": "Bold and energetic. You enjoy the hustle but don't mind stepping on toes.", "happiness_tip": "Collaborate more. Stop viewing everyone as a competitor." },
 "6": { "name": "The Socialite", "group": "Traditionalist", "description": "The life of the party, but prone to drama. You seek approval and are sensitive to rejection.", "happiness_tip": "Spend time alone. Learn to be comfortable by yourself." },
 "7": { "name": "The Good Neighbor", "group": "Traditionalist", "description": "Friendly, resilient, and fun-loving. You enjoy popular hobbies and keeping things simple.", "happiness_tip": "Try planning ahead. Structure will help you achieve dreams." },
 "8": { "name": "The Worker Bee", "group": "Traditionalist", "description": "Diligent but anxious. You work hard and follow the rules, but worry about making mistakes.", "happiness_tip": "Celebrate wins. Don't just focus on what could go wrong." },
 "9": { "name": "The Technician", "group": "Traditionalist", "description": "Disciplined and stable. You focus on facts and results, often ignoring social niceties.", "happiness_tip": "Soften your delivery. Bluntness can alienate people." },
 "10": { "name": "The Assistant", "group": "Traditionalist", "description": "Dutiful, kind, and anxious. You live to serve but often neglect yourself.", "happiness_tip": "Delegate. You don't have to do everything yourself." },
 "11": { "name": "The Administrator", "group": "Traditionalist", "description": "Reliable, stable, kind, and organized. You keep the world running smoothly.", "happiness_tip": "Take a risk. You might miss out on unplanned opportunities." },
 "12": { "name": "The Drill Sergeant", "group": "Traditionalist", "description": "Loud, organized, and demanding. You have high energy but can be stressful to be around.", "happiness_tip": "Practice patience. Intensity burns out your team." },
 "13": { "name": "The Manager", "group": "Traditionalist", "description": "A natural leader. Organized, outgoing, and thick-skinned. Focuses on efficiency.", "happiness_tip": "Listen more. Feedback makes you a better leader." },
 "14": { "name": "The Host", "group": "Traditionalist", "description": "You love organizing events but stress over every detail. You want everyone to be happy.", "happiness_tip": "Let go of perfection. People enjoy the party because of you." },
 "15": { "name": "The Pillar", "group": "Traditionalist", "description": "The Model Citizen. Social, organized, kind, and resilient.", "happiness_tip": "Question the status quo. Rarely asks if the rules are fair." },
 "16": { "name": "The Dreamer", "group": "Explorer", "description": "Creative but disorganized and anxious. You have a rich inner world.", "happiness_tip": "Build a routine. A schedule helps bring ideas to life." },
 "17": { "name": "The Poet", "group": "Explorer", "description": "Independent and creative. You follow your own muse and can be perceived as eccentric.", "happiness_tip": "Connect. Sharing your perspective is rewarding." },
 "18": { "name": "The Empath", "group": "Explorer", "description": "Deeply sensitive and creative. You feel the world intensely.", "happiness_tip": "Create boundaries. Shield yourself from negative energy." },
 "19": { "name": "The Philosopher", "group": "Explorer", "description": "Peaceful and creative. You enjoy abstract ideas but prefer a low-pressure life.", "happiness_tip": "Take action. Don't just think thoughts; share them." },
 "20": { "name": "The Agitator", "group": "Explorer", "description": "Chaotic and creative. You challenge authority and bore easily.", "happiness_tip": "Choose your battles. Save energy for projects." },
 "21": { "name": "The Daredevil", "group": "Explorer", "description": "Adventurous and fearless. You love new experiences but dislike rules.", "happiness_tip": "Think long-term. You need a plan for tomorrow." },
 "22": { "name": "The Performer", "group": "Explorer", "description": "Charismatic and emotional. You love to entertain but struggle with deadlines.", "happiness_tip": "Focus. Pick one idea and finish it." },
 "23": { "name": "The Happy Wanderer", "group": "Explorer", "description": "Enthusiastic and open-minded. You love everyone but lack direction.", "happiness_tip": "Find a mentor to help channel your energy." },
 "24": { "name": "The Mad Scientist", "group": "Explorer", "description": "Brilliant and obsessive. Creative and organized, but anxious.", "happiness_tip": "Step away from work. Go outside." },
 "25": { "name": "The Architect", "group": "Explorer", "description": "Strategic and cold. You build systems and prefer complex ideas over people.", "happiness_tip": "Practice soft skills to sell your ideas." },
 "26": { "name": "The Devotee", "group": "Explorer", "description": "Creative and disciplined. You work tirelessly for a cause but worry constantly.", "happiness_tip": "Trust the process. Relaxing makes you productive." },
 "27": { "name": "The Professor", "group": "Explorer", "description": "The ideal academic. Curious, disciplined, and stable.", "happiness_tip": "Share your knowledge. Don't stay in your tower." },
 "28": { "name": "The Commander", "group": "Explorer", "description": "Ambitious and intense. You have big vision but can burn bridges.", "happiness_tip": "Decompress. If you don't rest, you will crash." },
 "29": { "name": "The Innovator", "group": "Explorer", "description": "A visionary leader. New ideas, discipline, and confidence.", "happiness_tip": "Value harmony. Being right isn't everything." },
 "30": { "name": "The Teacher", "group": "Explorer", "description": "Passionate and organized. You love helping others grow but take failures personally.", "happiness_tip": "Detach with love. You cannot walk the path for them." },
 "31": { "name": "The Polymath", "group": "Explorer", "description": "The Golden Profile. High in all 5 traits. Potential to succeed anywhere.", "happiness_tip": "Focus. The hardest part is choosing what to do." }
}
